Numpy Complete

In [2]:
import numpy as np
import pandas as pd

In [3]:
dict1 = {
    "name": ['rudra', 'rohan', 'parthib', 'arnab'],
    "marks": [92, 95, 94, 93],
    "city": ['selmabad', 'kolkata', 'kharagpur', 'andul']
}

In [4]:
df = pd.DataFrame(dict1)

In [5]:
df

      name  marks       city
0    rudra     92   selmabad
1    rohan     95    kolkata
2  parthib     94  kharagpur
3    arnab     93      andul

In [6]:
df.to_csv('friends.csv')

In [7]:
df.to_csv('friends_index_F.csv', index= False)

In [8]:
df.head(2)

    name  marks      city
0  rudra     92  selmabad
1  rohan     95   kolkata

In [9]:
df.tail(2)

      name  marks       city
2  parthib     94  kharagpur
3    arnab     93      andul

In [10]:
df.describe()

           marks
count   4.000000
mean   93.500000
std     1.290994
min    92.000000
25%    92.750000
50%    93.500000
75%    94.250000
max    95.000000

df.describe makes an statical analysis on numerical columns

In [11]:
trainData = pd.read_csv('traindata.csv')

In [12]:
trainData

   train No  Speed destination
0     12345    115       delhi
1     45623    105      mumbai
2     78954    110     chennai
3     45217     91  derjeeling

In [13]:
trainData['Speed'][0] = 120

C:\Users\dasru\AppData\Local\Temp\ipykernel_186440\3356788141.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  trainData['Speed'][0] = 120

In [14]:
trainData

   train No  Speed destination
0     12345    120       delhi
1     45623    105      mumbai
2     78954    110     chennai
3     45217     91  derjeeling

In [15]:
trainData.to_csv('traindata.csv', index= False)